y1s1/cy1308-physics/week-1-kinematics/notes.org
#+TITLE: Kinematics Lecture Notes
#+AUTHOR: Hankertrix
#+STARTUP: showeverything
#+OPTIONS: toc:2
#+LATEX_HEADER: \usepackage{siunitx, array, tikz}
#+LATEX_HEADER: \usetikzlibrary{angles, calc, quotes}

\newpage

* $\text{Syst\`eme}$ Internationale (SI) $\text{d'unit\'es}$ (not very important)

This section is just some background on the redefinition of the SI units, which isn't very important, but it is good to know.

- The metric system was originally conceived as a system of measurement that was *derivable* from unchanging phenomena.
- Practical limitations necessitated the use of artefacts - the prototype metre and prototype kilogram. Some were difficult to precisely realise in a laboratory, such as the kelvin, which was defined in terms of the triple point of water.
- Masses of the prototype kilogram and its secondary copies have shown small variations relative to each other over time.
- As such, they are not thought to be adequate for the increasing accuracy demanded by science, prompting a search for a suitable replacement.


** Mass drift problem of the old SI

*** Mass drift of the prototype kilogram and derivatives
Masses of the prototype kilogram and its secondary copies have shown small variations relative to each other over time, prompting a search for a suitable replacement.

** Mass and its relation to fundamental constants

- Before 2019, Planck's constant $h$ had some uncertainty because it is determined experimentally. Frequency $f$ (or the SI unit for time) and the speed of light $c$ were already exact by 2019.
- In contrast, the IPK mass was absolutely certain because by definition it is $\qty{1}{kg}$.
- But this kilogram artefact (IPK) is practically inaccessible, being sealed in a vacuum jar and stored in a basement vault in Paris, and there are mass drifts with its derivative artefacts.

Thus, the solution was to define Planck's constant to be exact, and the mass of the kilogram will follow. The IPK will no longer be exactly $\qty{1}{kg}$.


** Redefinition of SI

*** Precedence for change
- *1960*: Redefined the SI metre in terms of the wavelength of krypton-86 radiation and discarded the pre-SI metre bar, which was a physical artefact.
- *1967*: Redefined the original definition of the second, which was based on Earth's average rotation from 1750 to 1892, with a definition based on the frequency of the radiation emitted or absorbed with a caesium-133 atomic transition between two hyperfine levels of the ground state.
- *1983*: Redefined the 1960 definition of the metre with one based on the second, by giving an exact definition of the speed of light in units of metres per second.

*** Redefinition of SI (2019)
There was a fundamental change to the definition of SI units in 2019. SI units became /entirely/ derivable from natural phenomena and didn't rely on physical artefacts. Most units were based on fundamental physical constants.

\newpage

*** Defining the physical constants
The International Bureau for Weights and Measures proposed that 4 further constants of nature (the first 4 below) be defined to have exact values.

- *Planck constant* $h$ is exactly $6.62607015 \times 10^{-34}$ joule-second ($\si{J} \cdot \si{s}$)
- *Elementary charge* $e$ is exactly $1.602176634 \times 10^{-19}$ coulomb ($\si{C}$).
- *Boltzmann constant* $k$ is exactly $1.380649 \times 10^{-23}$ joule per kelvin ($\si{J} \cdot \si{K}^{-1}$).
- *Avogadro constant* $N_A$ is exactly $6.02214076 \times 10^{23}$ reciprocal mole ($\si{mol}^{-1}$).
- *Speed of light* $c$ is exactly 299792458 metres per second ($\si{m} \cdot \si{s}^{-1}$).
- *Ground state hyperfine structure transition frequency* of caesium-133 atom $\Delta v_{Cs}$ is exactly 9192631770 hertz ($\si{\hertz}$).
- *Luminous efficacy* $K_{cd}$ of monochromatic radiation of frequency $540 \times 10^{12} \si{\hertz}$ (540 $\si{\tera\hertz}$) – a frequency of green-coloured light at approximately the peak sensitivity of the human eye – is exactly 683 lumens per watt ($\si{lm} \cdot \si{\watt}^{-1}$).

  \newpage

* Models in physics (also not very important)

** Models in physics as maps of the terrain (physical world)
Consider the legend of Galileo’s experiments on falling objects. He is supposed to have dropped them from the Leaning Tower of Pisa in Italy.
\\

"Galileo’s pupil, Vincenzo Viviani, wrote in 1717 in Racconto istorico della vita di Galileo Galilei, p. 606: [...dimostrando ciò con replicate esperienze, fatte dall'altezza del Campanile di Pisa con l'intervento delli altri lettori e filosofi e di tutta la scolaresca... *[... Galileo showed this [all bodies, whatever their weights, fall with equal speeds] by repeated experiments made from the height of the Leaning Tower of Pisa in the presence of other professors and all the students...]."*
\\

If Galileo had compared the motion of a rock and a feather, but had not “idealised” the motion, by perhaps imagining that the air could slow down the feather more than the rock, he would not have made the conclusion.
\\

It is through an idealisation or model of reality – by creating a map of the terrain – where air resistance is absent or equal for both objects, that Galileo could construct a model that captured the essence of the motion without all the complications of reality.
\\

To simplify the analysis of a baseball in flight, we use an idealised model. A real baseball in flight will spin and has a complex shape (a baseball in flight is not completely round). It will also have air resistance and wind that will exert forces on the ball The gravitational force exerted on the ball also depends on the ball's altitude as well.
\\

However, the idealised model that we use in physics treats the baseball as a point object (a particle of sorts). We ignore air resistance and we assume the gravitational force exerted on the ball is constant.

\newpage

** Physics is an empirical science
Physics, like chemistry and biology, is an *empirical* science.
\\

It contains propositions in the theories which are not deducible from definitions and must be tested with *empirical* evidence from observations about nature. At the same time, physics is a /dialogue/ with nature and observations can lead to new theory, and vice versa.

Below is a quote from scientific American, "Theoretical Physics Is Pointless without Experimental Tests":
\\

/“The experience of subjecting a theoretical conjecture to an experimental test is humbling. If the conjecture turns out to be wrong, it must be adjusted. Becoming a physicist brings with it the privilege of retaining your childhood curiosity throughout your adult life. There is no need to pretend you know more than you actually do, and you can admit mistakes if proven wrong by experience, just like a child who is seeking to learn about the world. Doing pure theory without worrying about experimental verification actually deprives one from the pleasure of learning something new about nature.”/


* Kinematics

** Scalar quantities
Scalar quantities are physical quantities that only have a magnitude and no direction. Examples of scalar quantities include time (\(\si{s}\)), speed (\(\si{ms^{-1}}\)) and temperature (\(\si{\celsius}\)).

