y1s1/cy1308-physics/week-1-kinematics/notes.tex
% Created 2023-08-26 Sat 18:19
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{siunitx, array, tikz}
\usetikzlibrary{angles, calc, quotes}
\author{Hankertrix}
\date{\today}
\title{Kinematics Lecture Notes}
\hypersetup{
 pdfauthor={Hankertrix},
 pdftitle={Kinematics Lecture Notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1 (Org mode 9.6.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
\tableofcontents

\newpage

\section{\(\text{Syst\`eme}\) Internationale (SI) \(\text{d'unit\'es}\) (not very important)}
\label{sec:org50ab051}

This section is just some background on the redefinition of the SI units, which isn't very important, but it is good to know.

\begin{itemize}
\item The metric system was originally conceived as a system of measurement that was \textbf{derivable} from unchanging phenomena.
\item Practical limitations necessitated the use of artefacts - the prototype metre and prototype kilogram. Some were difficult to precisely realise in a laboratory, such as the kelvin, which was defined in terms of the triple point of water.
\item Masses of the prototype kilogram and its secondary copies have shown small variations relative to each other over time.
\item As such, they are not thought to be adequate for the increasing accuracy demanded by science, prompting a search for a suitable replacement.
\end{itemize}


\subsection{Mass drift problem of the old SI}
\label{sec:orgef902c9}

\subsubsection{Mass drift of the prototype kilogram and derivatives}
\label{sec:orga62eb5d}
Masses of the prototype kilogram and its secondary copies have shown small variations relative to each other over time, prompting a search for a suitable replacement.

\subsection{Mass and its relation to fundamental constants}
\label{sec:orgac7b10e}

\begin{itemize}
\item Before 2019, Planck's constant \(h\) had some uncertainty because it is determined experimentally. Frequency \(f\) (or the SI unit for time) and the speed of light \(c\) were already exact by 2019.
\item In contrast, the IPK mass was absolutely certain because by definition it is \(\qty{1}{kg}\).
\item But this kilogram artefact (IPK) is practically inaccessible, being sealed in a vacuum jar and stored in a basement vault in Paris, and there are mass drifts with its derivative artefacts.
\end{itemize}

Thus, the solution was to define Planck's constant to be exact, and the mass of the kilogram will follow. The IPK will no longer be exactly \(\qty{1}{kg}\).


\subsection{Redefinition of SI}
\label{sec:org6cc8914}

\subsubsection{Precedence for change}
\label{sec:org2b94e54}
\begin{itemize}
\item \textbf{1960}: Redefined the SI metre in terms of the wavelength of krypton-86 radiation and discarded the pre-SI metre bar, which was a physical artefact.
\item \textbf{1967}: Redefined the original definition of the second, which was based on Earth's average rotation from 1750 to 1892, with a definition based on the frequency of the radiation emitted or absorbed with a caesium-133 atomic transition between two hyperfine levels of the ground state.
\item \textbf{1983}: Redefined the 1960 definition of the metre with one based on the second, by giving an exact definition of the speed of light in units of metres per second.
\end{itemize}

\subsubsection{Redefinition of SI (2019)}
\label{sec:org88b1483}
There was a fundamental change to the definition of SI units in 2019. SI units became \emph{entirely} derivable from natural phenomena and didn't rely on physical artefacts. Most units were based on fundamental physical constants.

\newpage

\subsubsection{Defining the physical constants}
\label{sec:org22a2e03}
The International Bureau for Weights and Measures proposed that 4 further constants of nature (the first 4 below) be defined to have exact values.

\begin{itemize}
\item \textbf{Planck constant} \(h\) is exactly \(6.62607015 \times 10^{-34}\) joule-second (\(\si{J} \cdot \si{s}\))
\item \textbf{Elementary charge} \(e\) is exactly \(1.602176634 \times 10^{-19}\) coulomb (\(\si{C}\)).
\item \textbf{Boltzmann constant} \(k\) is exactly \(1.380649 \times 10^{-23}\) joule per kelvin (\(\si{J} \cdot \si{K}^{-1}\)).
\item \textbf{Avogadro constant} \(N_A\) is exactly \(6.02214076 \times 10^{23}\) reciprocal mole (\(\si{mol}^{-1}\)).
\item \textbf{Speed of light} \(c\) is exactly 299792458 metres per second (\(\si{m} \cdot \si{s}^{-1}\)).
\item \textbf{Ground state hyperfine structure transition frequency} of caesium-133 atom \(\Delta v_{Cs}\) is exactly 9192631770 hertz (\(\si{\hertz}\)).
\item \textbf{Luminous efficacy} \(K_{cd}\) of monochromatic radiation of frequency \(540 \times 10^{12} \si{\hertz}\) (540 \(\si{\tera\hertz}\)) – a frequency of green-coloured light at approximately the peak sensitivity of the human eye – is exactly 683 lumens per watt (\(\si{lm} \cdot \si{\watt}^{-1}\)).

\newpage
\end{itemize}

\section{Models in physics (also not very important)}
\label{sec:org0f54ed3}

\subsection{Models in physics as maps of the terrain (physical world)}
\label{sec:org19f7cb0}
Consider the legend of Galileo’s experiments on falling objects. He is supposed to have dropped them from the Leaning Tower of Pisa in Italy.
\\[0pt]

"Galileo’s pupil, Vincenzo Viviani, wrote in 1717 in Racconto istorico della vita di Galileo Galilei, p. 606: [\ldots{}dimostrando ciò con replicate esperienze, fatte dall'altezza del Campanile di Pisa con l'intervento delli altri lettori e filosofi e di tutta la scolaresca\ldots{} \textbf{[\ldots{} Galileo showed this [all bodies, whatever their weights, fall with equal speeds] by repeated experiments made from the height of the Leaning Tower of Pisa in the presence of other professors and all the students\ldots{}]."}
\\[0pt]

If Galileo had compared the motion of a rock and a feather, but had not “idealised” the motion, by perhaps imagining that the air could slow down the feather more than the rock, he would not have made the conclusion.
\\[0pt]

It is through an idealisation or model of reality – by creating a map of the terrain – where air resistance is absent or equal for both objects, that Galileo could construct a model that captured the essence of the motion without all the complications of reality.
\\[0pt]

To simplify the analysis of a baseball in flight, we use an idealised model. A real baseball in flight will spin and has a complex shape (a baseball in flight is not completely round). It will also have air resistance and wind that will exert forces on the ball The gravitational force exerted on the ball also depends on the ball's altitude as well.
\\[0pt]

However, the idealised model that we use in physics treats the baseball as a point object (a particle of sorts). We ignore air resistance and we assume the gravitational force exerted on the ball is constant.

\newpage

\subsection{Physics is an empirical science}
\label{sec:org8018d46}
Physics, like chemistry and biology, is an \textbf{empirical} science.
\\[0pt]

It contains propositions in the theories which are not deducible from definitions and must be tested with \textbf{empirical} evidence from observations about nature. At the same time, physics is a \emph{dialogue} with nature and observations can lead to new theory, and vice versa.

Below is a quote from scientific American, "Theoretical Physics Is Pointless without Experimental Tests":
\\[0pt]

\emph{“The experience of subjecting a theoretical conjecture to an experimental test is humbling. If the conjecture turns out to be wrong, it must be adjusted. Becoming a physicist brings with it the privilege of retaining your childhood curiosity throughout your adult life. There is no need to pretend you know more than you actually do, and you can admit mistakes if proven wrong by experience, just like a child who is seeking to learn about the world. Doing pure theory without worrying about experimental verification actually deprives one from the pleasure of learning something new about nature.”}


\section{Kinematics}
\label{sec:orga4e4929}

\subsection{Scalar quantities}
\label{sec:org03df333}
Scalar quantities are physical quantities that only have a magnitude and no direction. Examples of scalar quantities include time (\(\si{s}\)), speed (\(\si{ms^{-1}}\)) and temperature (\(\si{\celsius}\)).
