y1s1/cy1308-physics/week-1-kinematics/notes.tex

\subsection{Vector quantities}
\label{sec:org173dc48}
Vector quantities are physical quantities that have \textbf{both} a magnitude and a direction. Examples of vector quantities include velocity (\(\si{ms^{-1}}\)), acceleration (\(\si{ms^{-2}}\)) and force (\(\si{N}\)).

\subsection{Position, displacement and distance}
\label{sec:orgd86a2fd}

\subsubsection{Position and coordinate system}
\label{sec:orgdf99316}
To study the motion of an object, we need to specify its \textbf{position} in a coordinate system. In 3D space, the coordinates will be a trio of numbers \((x, y, z)\) for the Cartesian system.

\subsubsection{Displacement (vector quantity)}
\label{sec:org47f5f14}
Displacement is the change in position of an object over a time interval (\(\Delta \vec{x}\)). It is expressed using the equation below, where \(\Delta \vec{x}\) is the displacement of the object, and \(\vec{x_f}\) and \(\vec{x_i}\) are the final position and the initial position of the object respectively:

\[\Delta \vec{x} = \vec{x}_f - \vec{x}_i\]

The displacement is only concerned with the \textbf{end points}, and not the path taken by the object during the time interval.
\\[0pt]

Do note that a change in any physical quantity is always its \textbf{final} value minus its \textbf{initial} value.

\subsubsection{Distance (scalar quantity)}
\label{sec:org47ed39a}
The distance is the length of the entire path taken by an object.


\subsection{Velocity and speed (SI units: \(\si{ms^{-1}}\))}
\label{sec:orga74b472}

\subsubsection{Average velocity (vector quantity)}
\label{sec:org1fc9df9}
The average velocity is the change in an object's position (\(\Delta \vec{x}\)) over a finite time interval (\(\Delta t\)). It is given by the equation below:

\[\text{Average velocity: } \Delta \vec{v}_{av} = \frac{\Delta \vec{x}}{\Delta t} = \frac{\vec{x}_2 - \vec{x}_1}{t_2 - t_1}\]

\subsubsection{Instantaneous velocity (vector quantity)}
\label{sec:org115e682}
The instantaneous velocity is the velocity of an object at a specific instance of time. Mathematically, it is when the limit of the time interval becomes an infinitesimally small value. This is expressed mathematically in the equation below:

\[\text{Instantaneous velocity: } \vec{v} = \lim_{\Delta t \rightarrow 0} \frac{\Delta \vec{x}}{\Delta t} = \frac{d \vec{x}}{dt}\]

In GCE A-level texts, the instantaneous velocity is often defined to be the rate of change of displacement. However, this should not be the case and the instantaneous velocity should be defined as the rate of change of \textbf{position}.

\subsubsection{Speed (scalar quantity)}
\label{sec:org77fb81c}
Speed is defined as the \textbf{magnitude} of velocity.

\subsubsection{Finding velocity from a graph}
\label{sec:org76e28b6}
From the equation for instantaneous velocity above, we know that \(\vec{v} = \frac{d \vec{x}}{dt}\). This means that the gradient at a point of a position-time (\(x - t\)) graph will give the instantaneous velocity of an object at that point in time.


\subsection{Acceleration (SI units: \(\si{ms^{-2}}\))}
\label{sec:orgfcd9159}

\subsubsection{Average acceleration (vector quantity)}
\label{sec:orgf4588b1}
The average acceleration is the change in velocity over a finite time interval. This is expressed mathematically in the equation below:

\[\text{Average acceleration: } \vec{a}_{av} = \frac{\Delta \vec{v}}{\Delta t} = \frac{\vec{v}_2 - \vec{v}_1}{t_2 - t_1}\]

\subsubsection{Instantaneous acceleration (vector quantity)}
\label{sec:org1fff232}
The instantaneous acceleration is the acceleration of an object at a specific instance of time. Mathematically, it is when the limit of the time interval becomes an infinitesimally small value. This is expressed mathematically in the equation below:

\[\text{Instantaneous acceleration: } \vec{a} = \lim_{\Delta t \rightarrow 0} \frac{\Delta \vec{v}}{\Delta t} = \frac{d \vec{v}}{dt} = \frac{d^2 \vec{x}}{dt^2}\]

The units of acceleration give a sense of how to understand this quantity. It is given by metres per second per second, i.e. it is the change in velocity (\(\si{ms^{-1}}\)) every second.

\subsubsection{Finding the acceleration from a graph}
\label{sec:org63b3367}
From the equation for instantaneous acceleration above, we know that \(\vec{a} = \frac{d \vec{v}}{dt}\). This means that the gradient at a point of a velocity-time (\(v - t\)) graph will give the instantaneous velocity of an object at that point in time.

\subsubsection{Accelerating while maintaining a constant speed?}
\label{sec:orga23889c}
Even when the speed of an object is constant (remember that the speed of an object is a scalar quantity), as long as the direction of the object changes, the \textbf{velocity} of the object is \textbf{changing}. This means a car has a non-zero acceleration if it rounds a bend at constant speed. Since the car's direction is changing, its \textbf{velocity} is also \textbf{changing} and hence it has \textbf{non-zero acceleration}.
\\[0pt]

Hence, you should not use the layman understanding of acceleration to mean speeding up. When there is an acceleration, it just means that the velocity is changing, which doesn't necessarily mean that the speed is changing.


\subsubsection{Relating acceleration to velocity}
\label{sec:org6d8c582}

\begin{center}
\begin{tabular}{ |m{11em}|m{11em}| }
\hline
If $x$-velocity is: & $x$-accleration is: \\
\hline
Positive \& increasing (getting more positive) & Positive: The object is moving in the $+ \, x$-direction \& speeding up \\
\hline
Positive \& decreasing (getting less positive) & Negative: The object is moving in the $+ \, x$-direction \& slowing down \\
\hline
Negative \& increasing (getting less negative) & Positive: The object is moving in the $- \, x$-direction \& slowing down \\
\hline
Negative \& decreasing (getting more negative) & Negative: The object is moving in the $- \, x$-direction \& speeding up \\
\hline
\end{tabular}
\end{center}


\subsection{The coordinate system}
\label{sec:orgd38fdd0}
The coordinate system is arbitrary, so the direction of motion of an object can either be considered positive or negative.
\\[0pt]

Usually, an object that is moving upwards will be considered as moving in the \(+ \, y\)-direction while an object that is moving downwards will be considered as moving in the \(- \, y\)-direction.
\\[0pt]

Similarly, an object moving right will usually be considered as moving in the \(+ \, x\)-direction while an object moving left will usually be considered as moving in the \(- \, x\)-direction.
