y1s1/cy1308-physics/week-1-kinematics/notes.org
** Deriving the equations of motion for constant acceleration
Let the initial time be 0 and the final time be $t$, i.e. \(t_i = 0, t_f = t\). Let $v_f$ be the final velocity of an object and $v_i$ be the initial velocity of an object.
\\

The change in velocity would be:
\[v_f - v_i = \int_0^t a \, dt\]

Since acceleration is constant:
\[v_f - v_i = at\]
\[v_f = v_i + at\]

Since the initial velocity is a constant (\(v_0\)) and the final velocity can be expressed as a function of time (\(v(t)\)), we have the *first* equation of motion:
\[v(t) = v_0 + at \tag{1}\]

With this equation we can also derive the displacement of an object:
\[x_f - x_i = \int_0^t v(t) \, dt\]
\[x_f - x_i = \int_0^t (v_0 + at) \, dt\]
\[x_f - x_i = v_0t + \frac{1}{2}at^2\]

Since the initial displacement is a constant (\(x_0\)) and the final displacement can be expressed as a function of time (\(x(t)\)):
\[x(t) - x_0 = v_0t + \frac{1}{2}at^2\]

Letting $s$ be the change in displacement, i.e. \(s = x(t) - x_0\), we have the *second* equation of motion:
\[s = v_0t + \frac{1}{2}at^2 \tag{2}\]

We can arrive at a final, independent equation of motion by using a chain-rule trick:
\[\text{Acceleration } a = \frac{dv}{dt} = \frac{dv}{dx} \frac{dx}{dt}\]
\[a = v \frac{dv}{dx}\]

Integrating with respect to $x$:
\[\int_{x_i}^{x_f} a \, dx = \int_{v_i}^{v_f} v \, dv\]

Since acceleration is constant:
\[a \int_{x_i}^{x_f} \, dx = \int_{v_i}^{v_f} v \, dv\]
\[a(x_f - x_i) = \frac{1}{2}((v_f)^2 - (v_i)^2)\]
\[2a(x_f - x_i) = (v_f)^2 - (v_i)^2 \tag{a}\]

Since $x_i$ and $v_i$ is constant, we can substitute $x_i = x_0$ and \(v_i = v_0\) into equation $(a)$:
\[2a(x_f - x_0) = (v_f)^2 - (v_0)^2\]
\[(v_f)^2 = (v_0)^2 + 2a(x_f - x_0)\]

Representing $x_f$ as $x$, $v_f$ as \(v\):
\[v^2 = (v_0)^2 + 2a(x - x_0)\]

Representing $x - x_0$ as \(s\), we get the *third and final* equation of motion:
\[v^2 = (v_0)^2 + 2as \tag{3}\]

\newpage

** Resolving vectors
A vector can be resolved into 2 separate perpendicular vectors that are independent of each other.

*** Examples

\begin{center}
\begin{tikzpicture}

% Start of the 1st example
% Setting the origin
\coordinate (origin) at (0,0);

% Draw the original vector
\draw[thick, ->] (origin) -- ++(60:4) coordinate (vec) node[midway, above left] {$\vec{v}$};

% Draw the resolved vectors
\draw[thick, black, ->] (origin) -- ++(2,0) node (x) {} node[right] {$x$} node[midway, below] {$\vec{v} \cos \theta$};
\draw[thick, black, ->] (origin) -- ++(0,3.464101615) node (y) {} node[above] {$y$} node[midway, left] {$\vec{v} \sin \theta$};

% Draw the dotted lines
\draw[dotted, black] (y) -- ++(2,0);
\draw[dotted, black] (x) -- ++(0,3.464101615);

% Draw the angle
\pic [draw=red, text=blue, ->, "$\theta$", angle eccentricity=1.5] {angle = x--origin--vec};

\end{tikzpicture}
\begin{tikzpicture}

% Start of the 2nd example
% Setting the origin
\coordinate (origin) at (0,0);

% Draw the original vector
\draw[thick, ->] (origin) -- ++(60:4) coordinate (vec) node[midway, above left] {$\vec{v}$};

% Draw the resolved vectors
\draw[thick, black, ->] (origin) -- ++(2,0) node (x) {} node[right] {$x$} node[midway, below] {$\vec{v} \sin \theta$};
\draw[thick, black, ->] (origin) -- ++(0,3.464101615) node (y) {} node[above] {$y$} node[midway, left] {$\vec{v} \cos \theta$};

% Draw the dotted lines
\draw[dotted, black] (y) -- ++(2,0);
\draw[dotted, black] (x) -- ++(0,3.464101615);

% Draw the angle
\pic [draw=red, text=blue, ->, "$\theta$", angle eccentricity=1.5] {angle = vec--origin--y};

\end{tikzpicture}

\[\]

\begin{tikzpicture}

% Start of the 3rd example
% Setting the origin
\coordinate (origin) at (0,0);

% Draw the original vector
\draw[thick, ->] (origin) -- ++(300:4) coordinate (vec) node[midway, above right] {$\vec{v}$};

% Draw the resolved vectors
\draw[thick, black, ->] (origin) -- ++(2,0) node (x) {} node[right] {$x$} node[midway, above] {$\vec{v} \sin \theta$};
\draw[thick, black, ->] (origin) -- ++(0,-3.464101615) node (y) {} node[below] {$y$} node[midway, left] {$\vec{v} \cos \theta$};

% Draw the dotted lines
\draw[dotted, black] (y) -- ++(2,0);
\draw[dotted, black] (x) -- ++(0,-3.464101615);

% Draw the angle
\pic [draw=red, text=blue, ->, "$\theta$", angle eccentricity=1.5] {angle = y--origin--vec};

\end{tikzpicture}
\begin{tikzpicture}

% Start of the 4th example
% Setting the origin
\coordinate (origin) at (0,0);

% Draw the original vector
\draw[thick, ->] (origin) -- ++(300:4) coordinate (vec) node[midway, above right] {$\vec{v}$};

% Draw the resolved vectors
\draw[thick, black, ->] (origin) -- ++(2,0) node (x) {} node[right] {$x$} node[midway, above] {$\vec{v} \cos \theta$};
\draw[thick, black, ->] (origin) -- ++(0,-3.464101615) node (y) {} node[below] {$y$} node[midway, left] {$\vec{v} \sin \theta$};

% Draw the dotted lines
\draw[dotted, black] (y) -- ++(2,0);
\draw[dotted, black] (x) -- ++(0,-3.464101615);

% Draw the angle
\pic [draw=red, text=blue, ->, "$\theta$", angle eccentricity=1.5] {angle = vec--origin--x};

\end{tikzpicture}

\end{center}


In general, the resolved vector $\vec{v}_r$ that encloses the angle between the original vector $\vec{v}$ and the resolved vector $\vec{v}_r$ will have a magnitude of $\vec{v} \cos \theta$. The other resolved vector will have a magnitude of $\vec{v} \sin \theta$.

\newpage

** Relative velocity

*** Definition
The velocity of a moving body seen by a particular observer is called the velocity /relative/ to that observer.

*** Frame of reference
A frame of reference is a coordinate system plus a timescale.

*** Conventions
- If point $P$ is moving relative to reference frame $A$, we denote the velocity of $P$ relative to frame $A$ as $v_{PA}$.
- If $P$ is moving relative to frame $B$ and frame $B$ is moving relative to frame $A$, then the velocity of $P$ relative to frame $A$ is:
\[\vec{v}_{PA} = \vec{v}_{PB} + \vec{v}_{BA}\]

- Sometimes, it can be helpful to change the sign of the second term together with the subscripts (this doesn't change the equation):
\[\vec{v}_{PA} = \vec{v}_{PB} - \vec{v}_{AB},\ \ \because \ \vec{v}_{AB} = -\vec{v}_{BA}\]

Note that $\because$ means because.

\newpage


* Summary

** General relations in kinematics
$\indent$ The gradient of a position-time ($x-t$) graph is velocity.
\[\vec{v} = \lim_{\Delta t \rightarrow 0} \frac{\Delta \vec{x}}{\Delta t} = \frac{d \vec{x}}{dt}\]

\[\Downarrow\]

The area under a velocity-time ($v-t$) graph is displacement.
\[\int_{\vec{x}_i}^{\vec{x}_f} \, d \vec{x} = \int_{t_i}^{t_f} \vec{v} t \, dt\]
\[\vec{x}_f - \vec{x}_i = \int_{t_i}^{t_f} \vec{v} t \, dt\]
\\

The gradient of a velocity-time ($v-t$) graph is acceleration.
\[\vec{a} = \lim_{\Delta t \rightarrow 0} \frac{\Delta \vec{v}}{\Delta t} = \frac{d \vec{v}}{dt} = \frac{d^2 \vec{x}}{dt^2}\]

\[\Downarrow\]

The area under an acceleration-time ($a-t$) graph is acceleration.
\[\int_{\vec{v}_i}^{\vec{v}_f} \, d \vec{v} = \int_{t_i}^{t_f} \vec{a} t \, dt\]
\[\vec{v}_f - \vec{v}_i = \int_{t_i}^{t_f} \vec{a} t \, dt\]


** Equations of motion for constant acceleration

\[v = v_0 + at \tag{1}\]
\[s = v_0t + \frac{1}{2} at^2 \tag{2}\]
\[v^2 = {v_0}^2 + 2as \tag{3}\]

** Relative velocity
\[\vec{v}_{PA} = \vec{v}_{PB} + \vec{v}_{BA}\]
